mithunbabbira/fleet_manager/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"
# CONFIG_BT_ENABLED is not set
# Wi-Fi SoftAP only when legacy on-device HTTP is enabled
# CONFIG_ESP_WIFI_SOFTAP_SUPPORT is not set
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
# Dual-bank OTA: boot new image as pending-verify; app must mark valid or rollback.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
# ESP32-C6 Mini is typically used over USB-Serial/JTAG (cu.usbmodem*), not UART0 pins.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set
CONFIG_ELM_CMD_TIMEOUT_MS=12000
# Printed carrier PCB LTE UART (not textbook TX↔RX cross):
# GPIO16 ESP-TX → modem RX, GPIO17 ESP-RX ← modem TX
CONFIG_NET_LTE_ENABLE=y
CONFIG_NET_LTE_UART_TX_GPIO=16
CONFIG_NET_LTE_UART_RX_GPIO=17
CONFIG_NET_LTE_APN="airtelgprs.com"
# LTE OTA auto-check (Trafyn firmware-check POST; override via SoftAP/NVS or change here)
CONFIG_FW_OTA_LTE_AUTO_CHECK=y
CONFIG_FW_OTA_LTE_CHECK_URL="https://api.trafyn.info/workflow-engine/realm/1/user/1/v1/execution/service/runWithNoAuth/get-latest-device-firmware?refreshCache=true"
CONFIG_FW_OTA_LTE_AUTO_WAIT_SEC=90
CONFIG_FW_OTA_LTE_AUTO_INTERVAL_H=4
# On-device HTTP/SoftAP off — use USB serial + tools/carrier_console on PC
# CONFIG_ELM_HTTP_ENABLE is not set
# Fleet Zigbee coordinator (ESP-Zigbee-SDK)
CONFIG_FLEET_ZIGBEE_ENABLE=y
CONFIG_FLEET_ZIGBEE_CHANNEL=15
CONFIG_ZB_ENABLED=y
CONFIG_ZB_ZCZR=y
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y
